<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class MenuSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $params = [
            ['id' => 1, 'shop_id' => '1', 'menu_name' => '松', 'price' => '5000', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身5種盛り、焼き物または揚げ物、お寿司、茶碗蒸し、お飲み物'],
            ['id' => 2, 'shop_id' => '1', 'menu_name' => '竹', 'price' => '3500', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身5種盛り、お寿司、茶碗蒸し、お飲み物'],
            ['id' => 3, 'shop_id' => '1', 'menu_name' => '梅', 'price' => '2500', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身3種盛り、お寿司、お飲み物'],
            ['id' => 4, 'shop_id' => '2', 'menu_name' => '宴会', 'price' => '4500', 'menu_detail' => 'おつまみキムチ＆ナムル、本日のサラダ、焼き野菜、牛タン塩、鶏もも＆豚トロの塩焼き、和牛上カルビ、漬けハラミ焼き、和牛の希少部位、和牛ホルモン、白ご飯、デザート'],
            ['id' => 5, 'shop_id' => '2', 'menu_name' => '特上', 'price' => '5000', 'menu_detail' => 'キムチとナムル、アスパラとベーコンのシーザーサラダ、旨塩キャベツ、焼き野菜、牛タン塩、鶏ももと豚トロの塩焼き、和牛上カルビ、新鮮ホルモン2種、うにく寿司、和牛の希少部位赤身、すき焼き、デザート'],
            ['id' => 6, 'shop_id' => '2', 'menu_name' => '女子会', 'price' => '4000', 'menu_detail' => 'おつまみキムチ＆ナムル、旨塩キャベツ、シーザーサラダ、鶏もものバジルチーズ、サムギョプサル、牛タン塩、鶏もも＆豚トロの塩焼き、和牛上カルビ、漬けハラミ焼き、たまごスープ、白ご飯、デザート、コーヒー or 紅茶'],
            ['id' => 7, 'shop_id' => '3', 'menu_name' => '萩', 'price' => '4000', 'menu_detail' => '小鉢2種、本日のサラダ、海老料理、鶏肉料理、豆腐料理、〆の一品、デザート、アルコール飲み放題'],
            ['id' => 8, 'shop_id' => '3', 'menu_name' => '葛', 'price' => '5000', 'menu_detail' => '小鉢2種、本日のサラダ、海老料理、鶏肉料理、魚料理、〆の一品、デザート、アルコール飲み放題'],
            ['id' => 9, 'shop_id' => '3', 'menu_name' => '撫子', 'price' => '7000', 'menu_detail' => '小鉢2種、本日のサラダ、海老料理、鶏肉料理、ステーキ、〆の一品、デザート、アルコール飲み放題'],
            ['id' => 10, 'shop_id' => '4', 'menu_name' => 'uno', 'price' => '2000', 'menu_detail' => '前菜の盛合せ、スープ、本日のパスタ、ドルチェ、食後のお飲み物'],
            ['id' => 11, 'shop_id' => '4', 'menu_name' => 'due', 'price' => '3500', 'menu_detail' => '小さな一皿、前菜の盛合せ、本日のパスタ、メインディッシュ（魚料理 or 肉料理）、ドルチェ、食後のお飲み物'],
            ['id' => 12, 'shop_id' => '4', 'menu_name' => 'tre', 'price' => '5000', 'menu_detail' => '小さな一皿、前菜の盛合せ、本日のパスタ、魚料理、肉料理、ドルチェ、食後のお飲み物'],
            ['id' => 13, 'shop_id' => '6', 'menu_name' => '宴会', 'price' => '4500', 'menu_detail' => 'おつまみキムチ＆ナムル、本日のサラダ、焼き野菜、牛タン塩、鶏もも＆豚トロの塩焼き、和牛上カルビ、漬けハラミ焼き、和牛の希少部位、和牛ホルモン、白ご飯、デザート'],
            ['id' => 14, 'shop_id' => '6', 'menu_name' => '特上', 'price' => '5000', 'menu_detail' => 'キムチとナムル、アスパラとベーコンのシーザーサラダ、旨塩キャベツ、焼き野菜、牛タン塩、鶏ももと豚トロの塩焼き、和牛上カルビ、新鮮ホルモン2種、うにく寿司、和牛の希少部位赤身、すき焼き、デザート'],
            ['id' => 15, 'shop_id' => '6', 'menu_name' => '女子会', 'price' => '4000', 'menu_detail' => 'おつまみキムチ＆ナムル、旨塩キャベツ、シーザーサラダ、鶏もものバジルチーズ、サムギョプサル、牛タン塩、鶏もも＆豚トロの塩焼き、和牛上カルビ、漬けハラミ焼き、たまごスープ、白ご飯、デザート、コーヒー or 紅茶'],
            ['id' => 16, 'shop_id' => '7', 'menu_name' => 'uno', 'price' => '2000', 'menu_detail' => '前菜の盛合せ、スープ、本日のパスタ、ドルチェ、食後のお飲み物'],
            ['id' => 17, 'shop_id' => '7', 'menu_name' => 'due', 'price' => '3500', 'menu_detail' => '小さな一皿、前菜の盛合せ、本日のパスタ、メインディッシュ（魚料理 or 肉料理）、ドルチェ、食後のお飲み物'],
            ['id' => 18, 'shop_id' => '7', 'menu_name' => 'tre', 'price' => '5000', 'menu_detail' => '小さな一皿、前菜の盛合せ、本日のパスタ、魚料理、肉料理、ドルチェ、食後のお飲み物'],
            ['id' => 19, 'shop_id' => '9', 'menu_name' => '萩', 'price' => '4000', 'menu_detail' => '小鉢2種、本日のサラダ、海老料理、鶏肉料理、豆腐料理、〆の一品、デザート、アルコール飲み放題'],
            ['id' => 20, 'shop_id' => '9', 'menu_name' => '葛', 'price' => '5000', 'menu_detail' => '小鉢2種、本日のサラダ、海老料理、鶏肉料理、魚料理、〆の一品、デザート、アルコール飲み放題'],
            ['id' => 21, 'shop_id' => '9', 'menu_name' => '撫子', 'price' => '7000', 'menu_detail' => '小鉢2種、本日のサラダ、海老料理、鶏肉料理、ステーキ、〆の一品、デザート、アルコール飲み放題'],
            ['id' => 22, 'shop_id' => '10', 'menu_name' => '松', 'price' => '5000', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身5種盛り、焼き物または揚げ物、お寿司、茶碗蒸し、お飲み物'],
            ['id' => 23, 'shop_id' => '10', 'menu_name' => '竹', 'price' => '3500', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身5種盛り、お寿司、茶碗蒸し、お飲み物'],
            ['id' => 24, 'shop_id' => '10', 'menu_name' => '梅', 'price' => '2500', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身3種盛り、お寿司、お飲み物'],
            ['id' => 25, 'shop_id' => '11', 'menu_name' => '宴会', 'price' => '4500', 'menu_detail' => 'おつまみキムチ＆ナムル、本日のサラダ、焼き野菜、牛タン塩、鶏もも＆豚トロの塩焼き、和牛上カルビ、漬けハラミ焼き、和牛の希少部位、和牛ホルモン、白ご飯、デザート'],
            ['id' => 26, 'shop_id' => '11', 'menu_name' => '特上', 'price' => '5000', 'menu_detail' => 'キムチとナムル、アスパラとベーコンのシーザーサラダ、旨塩キャベツ、焼き野菜、牛タン塩、鶏ももと豚トロの塩焼き、和牛上カルビ、新鮮ホルモン2種、うにく寿司、和牛の希少部位赤身、すき焼き、デザート'],
            ['id' => 27, 'shop_id' => '11', 'menu_name' => '女子会', 'price' => '4000', 'menu_detail' => 'おつまみキムチ＆ナムル、旨塩キャベツ、シーザーサラダ、鶏もものバジルチーズ、サムギョプサル、牛タン塩、鶏もも＆豚トロの塩焼き、和牛上カルビ、漬けハラミ焼き、たまごスープ、白ご飯、デザート、コーヒー or 紅茶'],
            ['id' => 28, 'shop_id' => '12', 'menu_name' => '宴会', 'price' => '4500', 'menu_detail' => 'おつまみキムチ＆ナムル、本日のサラダ、焼き野菜、牛タン塩、鶏もも＆豚トロの塩焼き、和牛上カルビ、漬けハラミ焼き、和牛の希少部位、和牛ホルモン、白ご飯、デザート'],
            ['id' => 29, 'shop_id' => '12', 'menu_name' => '特上', 'price' => '5000', 'menu_detail' => 'キムチとナムル、アスパラとベーコンのシーザーサラダ、旨塩キャベツ、焼き野菜、牛タン塩、鶏ももと豚トロの塩焼き、和牛上カルビ、新鮮ホルモン2種、うにく寿司、和牛の希少部位赤身、すき焼き、デザート'],
            ['id' => 30, 'shop_id' => '12', 'menu_name' => '女子会', 'price' => '4000', 'menu_detail' => 'おつまみキムチ＆ナムル、旨塩キャベツ、シーザーサラダ、鶏もものバジルチーズ、サムギョプサル、牛タン塩、鶏もも＆豚トロの塩焼き、和牛上カルビ、漬けハラミ焼き、たまごスープ、白ご飯、デザート、コーヒー or 紅茶'],
            ['id' => 31, 'shop_id' => '13', 'menu_name' => '萩', 'price' => '4000', 'menu_detail' => '小鉢2種、本日のサラダ、海老料理、鶏肉料理、豆腐料理、〆の一品、デザート、アルコール飲み放題'],
            ['id' => 32, 'shop_id' => '13', 'menu_name' => '葛', 'price' => '5000', 'menu_detail' => '小鉢2種、本日のサラダ、海老料理、鶏肉料理、魚料理、〆の一品、デザート、アルコール飲み放題'],
            ['id' => 33, 'shop_id' => '13', 'menu_name' => '撫子', 'price' => '7000', 'menu_detail' => '小鉢2種、本日のサラダ、海老料理、鶏肉料理、ステーキ、〆の一品、デザート、アルコール飲み放題'],
            ['id' => 34, 'shop_id' => '14', 'menu_name' => '松', 'price' => '3000', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身5種盛り、焼き物または揚げ物、お寿司、茶碗蒸し、お飲み物'],
            ['id' => 35, 'shop_id' => '14', 'menu_name' => '竹', 'price' => '5000', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身5種盛り、お寿司、茶碗蒸し、お飲み物'],
            ['id' => 36, 'shop_id' => '14', 'menu_name' => '梅', 'price' => '8000', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身3種盛り、お寿司、お飲み物'],
            ['id' => 37, 'shop_id' => '16', 'menu_name' => '萩', 'price' => '4000', 'menu_detail' => '小鉢2種、本日のサラダ、海老料理、鶏肉料理、豆腐料理、〆の一品、デザート、アルコール飲み放題'],
            ['id' => 38, 'shop_id' => '16', 'menu_name' => '葛', 'price' => '5000', 'menu_detail' => '小鉢2種、本日のサラダ、海老料理、鶏肉料理、魚料理、〆の一品、デザート、アルコール飲み放題'],
            ['id' => 39, 'shop_id' => '16', 'menu_name' => '撫子', 'price' => '7000', 'menu_detail' => '小鉢2種、本日のサラダ、海老料理、鶏肉料理、ステーキ、〆の一品、デザート、アルコール飲み放題'],
            ['id' => 40, 'shop_id' => '17', 'menu_name' => '松', 'price' => '5000', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身5種盛り、焼き物または揚げ物、お寿司、茶碗蒸し、お飲み物'],
            ['id' => 41, 'shop_id' => '17', 'menu_name' => '竹', 'price' => '3500', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身5種盛り、お寿司、茶碗蒸し、お飲み物'],
            ['id' => 42, 'shop_id' => '17', 'menu_name' => '梅', 'price' => '2500', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身3種盛り、お寿司、お飲み物'],
            ['id' => 43, 'shop_id' => '18', 'menu_name' => '宴会', 'price' => '4500', 'menu_detail' => 'おつまみキムチ＆ナムル、本日のサラダ、焼き野菜、牛タン塩、鶏もも＆豚トロの塩焼き、和牛上カルビ、漬けハラミ焼き、和牛の希少部位、和牛ホルモン、白ご飯、デザート'],
            ['id' => 44, 'shop_id' => '18', 'menu_name' => '特上', 'price' => '5000', 'menu_detail' => 'キムチとナムル、アスパラとベーコンのシーザーサラダ、旨塩キャベツ、焼き野菜、牛タン塩、鶏ももと豚トロの塩焼き、和牛上カルビ、新鮮ホルモン2種、うにく寿司、和牛の希少部位赤身、すき焼き、デザート'],
            ['id' => 45, 'shop_id' => '18', 'menu_name' => '女子会', 'price' => '4000', 'menu_detail' => 'おつまみキムチ＆ナムル、旨塩キャベツ、シーザーサラダ、鶏もものバジルチーズ、サムギョプサル、牛タン塩、鶏もも＆豚トロの塩焼き、和牛上カルビ、漬けハラミ焼き、たまごスープ、白ご飯、デザート、コーヒー or 紅茶'],
            ['id' => 46, 'shop_id' => '19', 'menu_name' => 'uno', 'price' => '2000', 'menu_detail' => '前菜の盛合せ、スープ、本日のパスタ、ドルチェ、食後のお飲み物'],
            ['id' => 47, 'shop_id' => '19', 'menu_name' => 'due', 'price' => '3500', 'menu_detail' => '小さな一皿、前菜の盛合せ、本日のパスタ、メインディッシュ（魚料理 or 肉料理）、ドルチェ、食後のお飲み物'],
            ['id' => 48, 'shop_id' => '19', 'menu_name' => 'tre', 'price' => '5000', 'menu_detail' => '小さな一皿、前菜の盛合せ、本日のパスタ、魚料理、肉料理、ドルチェ、食後のお飲み物'],
            ['id' => 49, 'shop_id' => '20', 'menu_name' => '松', 'price' => '5000', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身5種盛り、焼き物または揚げ物、お寿司、茶碗蒸し、お飲み物'],
            ['id' => 50, 'shop_id' => '20', 'menu_name' => '竹', 'price' => '3500', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身5種盛り、お寿司、茶碗蒸し、お飲み物'],
            ['id' => 51, 'shop_id' => '20', 'menu_name' => '梅', 'price' => '2500', 'menu_detail' => '季節の口取り、季節の小鉢料理2種、お刺身3種盛り、お寿司、お飲み物'],
        ];
        DB::table('menus')->insert($params);
    }
}
